## Plan Result (prod-enterprise)




<pre><code>Plan: 14 to add, 16 to change, 0 to destroy.</code></pre>

* Create
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].time_rotating.one_year
* Update
  * module.enterprise.azurerm_management_group.level_3[&#34;CFT-Sandbox&#34;]
  * module.environment[&#34;prod&#34;].azuread_application.app
  * module.environment[&#34;ptlsbox&#34;].azuread_application.app
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azuread_application.app
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-CFTAPPS-SBOX&#34;].azurerm_subscription.this




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.enterprise.azurerm_management_group.level_3["CFT-Sandbox"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/CFT-Sandbox"
        name                       = "CFT-Sandbox"
      ~ subscription_ids           = [
          + "b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb",
            # (1 unchanged element hidden)
        ]
        # (2 unchanged attributes hidden)
    }

  # module.environment["prod"].azuread_application.app will be updated in-place
  ~ resource "azuread_application" "app" {
        id                             = "9c149b18-7537-4b03-9093-641191faee0b"
      ~ owners                         = [
          - "6d2f8452-ba93-4a50-87a5-16e00f73af47",
        ]
        tags                           = []
        # (14 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.environment["ptlsbox"].azuread_application.app will be updated in-place
  ~ resource "azuread_application" "app" {
        id                             = "3fdcf12a-6a2c-46fc-be16-71510f849748"
      ~ owners                         = [
          - "23b042ae-86bd-4bb1-a9c0-04a24e1b435f",
        ]
        tags                           = []
        # (14 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azuread_application.acme_appreg[0] will be created
  + resource "azuread_application" "acme_appreg" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "acme-dcd-cftapps-sbox"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + api {
          + requested_access_token_version = 1

          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the application to access acme-dcd-cftapps-sbox on behalf of the signed-in user."
              + admin_consent_display_name = "Access acme-dcd-cftapps-sbox"
              + enabled                    = true
              + id                         = (known after apply)
              + type                       = "User"
              + user_consent_description   = "Allow the application to access acme-dcd-cftapps-sbox on your behalf."
              + user_consent_display_name  = "Access acme-dcd-cftapps-sbox"
              + value                      = "user_impersonation"
            }
        }

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }

      + required_resource_access {
          + resource_app_id = "00000003-0000-0000-c000-000000000000"

          + resource_access {
              + id   = "e1fe6dd8-ba31-4d61-89e7-88639da4683d"
              + type = "Scope"
            }
        }

      + web {
          + redirect_uris = [
              + "https://acmedcdcftappssbox.azurewebsites.net/.auth/login/aad/callback",
            ]

          + implicit_grant {
              + access_token_issuance_enabled = true
              + id_token_issuance_enabled     = true
            }
        }
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azuread_application.app will be updated in-place
  ~ resource "azuread_application" "app" {
        id                             = "f87ef2b4-59fc-4235-942e-4e79723792e4"
      ~ oauth2_permission_scope_ids    = {
          - "user_impersonation" = "693665fe-4adb-497b-997f-7191d8af0333"
        } -> (known after apply)
        tags                           = []
        # (14 unchanged attributes hidden)

      ~ api {
            # (3 unchanged attributes hidden)

          - oauth2_permission_scope {
              - admin_consent_description  = "Allow the application to access DTS Bootstrap (sub:dcd-cftapps-sbox) on behalf of the signed-in user." -> null
              - admin_consent_display_name = "Access DTS Bootstrap (sub:dcd-cftapps-sbox)" -> null
              - enabled                    = true -> null
              - id                         = "693665fe-4adb-497b-997f-7191d8af0333" -> null
              - type                       = "User" -> null
              - user_consent_description   = "Allow the application to access DTS Bootstrap (sub:dcd-cftapps-sbox) on your behalf." -> null
              - user_consent_display_name  = "Access DTS Bootstrap (sub:dcd-cftapps-sbox)" -> null
              - value                      = "user_impersonation" -> null
            }
          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the application to access DTS Bootstrap (sub:dcd-cftapps-sbox) on behalf of the signed-in user."
              + admin_consent_display_name = "Access DTS Bootstrap (sub:dcd-cftapps-sbox)"
              + enabled                    = true
              + id                         = (known after apply)
              + type                       = "User"
              + user_consent_description   = "Allow the application to access DTS Bootstrap (sub:dcd-cftapps-sbox) on your behalf."
              + user_consent_display_name  = "Access DTS Bootstrap (sub:dcd-cftapps-sbox)"
              + value                      = "user_impersonation"
            }
        }

      + required_resource_access {
          + resource_app_id = "00000003-0000-0000-c000-000000000000"

          + resource_access {
              + id   = "06da0dbc-49e2-44d2-8312-53f166ab848a"
              + type = "Scope"
            }
          + resource_access {
              + id   = "5b567255-7703-4780-807c-7be8301ae99b"
              + type = "Role"
            }
          + resource_access {
              + id   = "9a5d68dd-52b0-4cc2-bd40-abcf44ac3a30"
              + type = "Role"
            }
        }
      - required_resource_access {
          - resource_app_id = "00000003-0000-0000-c000-000000000000" -> null

          - resource_access {
              - id   = "06da0dbc-49e2-44d2-8312-53f166ab848a" -> null
              - type = "Scope" -> null
            }
        }

      ~ web {
          ~ homepage_url  = "https://dts-bootstrap-application" -> "https://dev.azure.com/hmcts/PlatformOperations"
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azuread_application_password.token will be created
  + resource "azuread_application_password" "token" {
      + application_object_id = "f87ef2b4-59fc-4235-942e-4e79723792e4"
      + display_name          = (known after apply)
      + end_date              = (known after apply)
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + rotate_when_changed   = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azuread_group.groups["Azure Kubernetes Service Cluster Admin Role"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DCD-CFTAPPS-SBOX AKS Administrators" -> "Grants aks cluster admin permissions to the DCD-CFTAPPS-SBOX subscription"
        id                         = "a61704af-0d13-49ce-9ec7-2ad4f5bad9b5"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azuread_group.groups["Azure Kubernetes Service Cluster User Role"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DCD-CFTAPPS-SBOX AKS Users" -> "Grants aks cluster user permissions to the DCD-CFTAPPS-SBOX subscription"
        id                         = "929b595d-09d1-4e4a-bde7-b155dad5aaae"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azuread_group.groups["Contributor"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DCD-CFTAPPS-SBOX Subscription Contributors" -> "Grants contributor permissions to the DCD-CFTAPPS-SBOX subscription"
        id                         = "f26dfcc6-4a92-4dfe-90a8-fa8a868747ca"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azuread_group.groups["Key Vault Administrator"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DCD-CFTAPPS-SBOX Subscription Key Vault Administrators" -> "Grants key vault administrator permissions to the DCD-CFTAPPS-SBOX subscription"
        id                         = "06fe4586-464c-41f2-90d3-2044f8758541"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azuread_group.groups["Owner"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DCD-CFTAPPS-SBOX Subscription Owners" -> "Grants owner permissions to the DCD-CFTAPPS-SBOX subscription"
        id                         = "785fc227-7ac0-481b-bf1a-505ed29b91c6"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azuread_group.groups["Reader"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DCD-CFTAPPS-SBOX Subscription Readers" -> "Grants reader permissions to the DCD-CFTAPPS-SBOX subscription"
        id                         = "13b7591b-6a22-41f7-aeb4-89926785c0ce"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azuread_group.groups["Security Reader"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants security reader permissions to the DCD-CFTAPPS-SBOX subscription"
      + display_name                   = "DTS Security Readers (sub:dcd-cftapps-sbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azuread_group.groups["Storage Blob Data Reader"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DCD-CFTAPPS-SBOX Subscription Blob Readers" -> "Grants storage blob data contributor permissions to the DCD-CFTAPPS-SBOX subscription"
        id                         = "ddc6597c-3cbe-4090-920c-1b336eaa4a15"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azuread_group_member.members["Azure Kubernetes Service Cluster Admin Role-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "a61704af-0d13-49ce-9ec7-2ad4f5bad9b5"
      + id               = (known after apply)
      + member_object_id = "a6ce5b32-e0a5-419e-ba5c-67863c975941"
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azuread_group_member.members["Contributor-2"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "f26dfcc6-4a92-4dfe-90a8-fa8a868747ca"
      + id               = (known after apply)
      + member_object_id = "0ec60e03-4262-44ce-abcf-83e2131c9207"
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azuread_group_member.members["Key Vault Administrator-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "06fe4586-464c-41f2-90d3-2044f8758541"
      + id               = (known after apply)
      + member_object_id = "af66f4e5-bd36-4ad9-a265-d9e7c947cbab"
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azuread_group_member.members["Key Vault Administrator-1"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "06fe4586-464c-41f2-90d3-2044f8758541"
      + id               = (known after apply)
      + member_object_id = "173fde48-bd6b-44f1-bb63-6fe6c90424ca"
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azuread_group_member.members["Owner-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "785fc227-7ac0-481b-bf1a-505ed29b91c6"
      + id               = (known after apply)
      + member_object_id = "173fde48-bd6b-44f1-bb63-6fe6c90424ca"
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                        = "c79eea76-244f-488c-a204-125de34d6d33"
        # (7 unchanged attributes hidden)

      + credentials {
          + serviceprincipalid  = "0c596c5f-3074-4ef0-807f-7b4ec15c128f"
          + serviceprincipalkey = (sensitive value)
        }

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/cb72ab7b703b0f2c6a1bbkv"
        name                            = "cb72ab7b703b0f2c6a1bbkv"
      ~ tags                            = {
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise"
            # (4 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azurerm_key_vault_secret.aks_admin_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_admin_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/cb72ab7b703b0f2c6a1bbkv"
      + name                    = "aks-admin-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azurerm_key_vault_secret.aks_user_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_user_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/cb72ab7b703b0f2c6a1bbkv"
      + name                    = "aks-user-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
      + content_type            = ""
        id                      = "https://cb72ab7b703b0f2c6a1bbkv.vault.azure.net/secrets/sp-token/5b44ec3c11c44c7b9083455efd636a15"
        name                    = "sp-token"
        tags                    = {}
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azurerm_role_assignment.local_groups["Security Reader"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azurerm_storage_account.sa will be updated in-place
  ~ resource "azurerm_storage_account" "sa" {
      + cross_tenant_replication_enabled  = true
        id                                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.Storage/storageAccounts/cb72ab7b703b0f2c6a1bbsa"
      ~ min_tls_version                   = "TLS1_0" -> "TLS1_2"
        name                              = "cb72ab7b703b0f2c6a1bbsa"
      ~ tags                              = {
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise"
            # (4 unchanged elements hidden)
        }
        # (34 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].azurerm_subscription.this will be updated in-place
  ~ resource "azurerm_subscription" "this" {
      + billing_scope_id  = "/providers/Microsoft.Billing/billingAccounts/59232335/enrollmentAccounts/233705"
        id                = "/providers/Microsoft.Subscription/aliases/DCD-CFTAPPS-SBOX"
        tags              = {}
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].random_uuid.acme_app_uuid[0] will be created
  + resource "random_uuid" "acme_app_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].random_uuid.app_uuid will be created
  + resource "random_uuid" "app_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.subscription["DCD-CFTAPPS-SBOX"].time_rotating.one_year will be created
  + resource "time_rotating" "one_year" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 14 to add, 16 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":37,"Program":"tfcmt","SHA1":"","Target":"prod-enterprise","Vars":{}} -->